experiments/raw-data/envA-medium-20260507-233035/k6-output.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/medium.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 30 max VUs, 5m0s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 4m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 3 complete and 0 interrupted iterations
default   [   0% ] 01/30 VUs  0m01.0s/4m30.0s

running (0m02.0s), 01/30 VUs, 7 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m02.0s/4m30.0s

running (0m03.0s), 02/30 VUs, 16 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m03.0s/4m30.0s

running (0m04.0s), 02/30 VUs, 24 complete and 0 interrupted iterations
default   [   1% ] 02/30 VUs  0m04.0s/4m30.0s

running (0m05.0s), 03/30 VUs, 35 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m05.0s/4m30.0s

running (0m06.0s), 03/30 VUs, 47 complete and 0 interrupted iterations
default   [   2% ] 03/30 VUs  0m06.0s/4m30.0s

running (0m07.0s), 04/30 VUs, 60 complete and 0 interrupted iterations
default   [   3% ] 04/30 VUs  0m07.0s/4m30.0s

running (0m08.0s), 04/30 VUs, 74 complete and 0 interrupted iterations
default   [   3% ] 04/30 VUs  0m08.0s/4m30.0s

running (0m09.0s), 05/30 VUs, 92 complete and 0 interrupted iterations
default   [   3% ] 05/30 VUs  0m09.0s/4m30.0s

running (0m10.0s), 05/30 VUs, 100 complete and 0 interrupted iterations
default   [   4% ] 05/30 VUs  0m10.0s/4m30.0s

running (0m11.0s), 06/30 VUs, 101 complete and 0 interrupted iterations
default   [   4% ] 06/30 VUs  0m11.0s/4m30.0s

running (0m12.0s), 06/30 VUs, 116 complete and 0 interrupted iterations
default   [   4% ] 06/30 VUs  0m12.0s/4m30.0s

running (0m13.0s), 07/30 VUs, 139 complete and 0 interrupted iterations
default   [   5% ] 07/30 VUs  0m13.0s/4m30.0s

running (0m14.0s), 07/30 VUs, 157 complete and 0 interrupted iterations
default   [   5% ] 07/30 VUs  0m14.0s/4m30.0s

running (0m15.0s), 08/30 VUs, 157 complete and 0 interrupted iterations
default   [   6% ] 08/30 VUs  0m15.0s/4m30.0s

running (0m16.0s), 08/30 VUs, 171 complete and 0 interrupted iterations
default   [   6% ] 08/30 VUs  0m16.0s/4m30.0s

running (0m17.0s), 09/30 VUs, 195 complete and 0 interrupted iterations
default   [   6% ] 09/30 VUs  0m17.0s/4m30.0s

running (0m18.0s), 09/30 VUs, 219 complete and 0 interrupted iterations
default   [   7% ] 09/30 VUs  0m18.0s/4m30.0s

running (0m19.0s), 10/30 VUs, 238 complete and 0 interrupted iterations
default   [   7% ] 10/30 VUs  0m19.0s/4m30.0s

running (0m20.0s), 10/30 VUs, 260 complete and 0 interrupted iterations
default   [   7% ] 10/30 VUs  0m20.0s/4m30.0s

running (0m21.0s), 11/30 VUs, 294 complete and 0 interrupted iterations
default   [   8% ] 11/30 VUs  0m21.0s/4m30.0s

running (0m22.0s), 11/30 VUs, 307 complete and 0 interrupted iterations
default   [   8% ] 11/30 VUs  0m22.0s/4m30.0s

running (0m23.0s), 12/30 VUs, 335 complete and 0 interrupted iterations
default   [   9% ] 12/30 VUs  0m23.0s/4m30.0s

running (0m24.0s), 12/30 VUs, 352 complete and 0 interrupted iterations
default   [   9% ] 12/30 VUs  0m24.0s/4m30.0s

running (0m25.0s), 13/30 VUs, 362 complete and 0 interrupted iterations
default   [   9% ] 13/30 VUs  0m25.0s/4m30.0s

running (0m26.0s), 13/30 VUs, 413 complete and 0 interrupted iterations
default   [  10% ] 13/30 VUs  0m26.0s/4m30.0s

running (0m27.0s), 14/30 VUs, 452 complete and 0 interrupted iterations
default   [  10% ] 14/30 VUs  0m27.0s/4m30.0s

running (0m28.0s), 14/30 VUs, 454 complete and 0 interrupted iterations
default   [  10% ] 14/30 VUs  0m28.0s/4m30.0s

running (0m29.0s), 15/30 VUs, 454 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m29.0s/4m30.0s

running (0m30.0s), 15/30 VUs, 491 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m30.0s/4m30.0s

running (0m31.0s), 15/30 VUs, 509 complete and 0 interrupted iterations
default   [  11% ] 15/30 VUs  0m31.0s/4m30.0s

running (0m32.0s), 16/30 VUs, 513 complete and 0 interrupted iterations
default   [  12% ] 16/30 VUs  0m32.0s/4m30.0s

running (0m33.0s), 16/30 VUs, 550 complete and 0 interrupted iterations
default   [  12% ] 16/30 VUs  0m33.0s/4m30.0s

running (0m34.0s), 17/30 VUs, 606 complete and 0 interrupted iterations
default   [  13% ] 17/30 VUs  0m34.0s/4m30.0s

running (0m35.0s), 17/30 VUs, 655 complete and 0 interrupted iterations
default   [  13% ] 17/30 VUs  0m35.0s/4m30.0s

running (0m36.0s), 18/30 VUs, 671 complete and 0 interrupted iterations
default   [  13% ] 18/30 VUs  0m36.0s/4m30.0s

running (0m37.0s), 18/30 VUs, 671 complete and 0 interrupted iterations
default   [  14% ] 18/30 VUs  0m37.0s/4m30.0s

running (0m38.0s), 19/30 VUs, 705 complete and 0 interrupted iterations
default   [  14% ] 19/30 VUs  0m38.0s/4m30.0s

running (0m39.0s), 19/30 VUs, 734 complete and 0 interrupted iterations
default   [  14% ] 19/30 VUs  0m39.0s/4m30.0s

running (0m40.0s), 20/30 VUs, 734 complete and 0 interrupted iterations
default   [  15% ] 20/30 VUs  0m40.0s/4m30.0s

running (0m41.0s), 20/30 VUs, 736 complete and 0 interrupted iterations
default   [  15% ] 20/30 VUs  0m41.0s/4m30.0s

running (0m42.0s), 21/30 VUs, 776 complete and 0 interrupted iterations
default   [  16% ] 21/30 VUs  0m42.0s/4m30.0s

running (0m43.0s), 21/30 VUs, 783 complete and 0 interrupted iterations
default   [  16% ] 21/30 VUs  0m43.0s/4m30.0s

running (0m44.0s), 22/30 VUs, 792 complete and 0 interrupted iterations
default   [  16% ] 22/30 VUs  0m44.0s/4m30.0s

running (0m45.0s), 22/30 VUs, 800 complete and 0 interrupted iterations
default   [  17% ] 22/30 VUs  0m45.0s/4m30.0s

running (0m46.0s), 23/30 VUs, 819 complete and 0 interrupted iterations
default   [  17% ] 23/30 VUs  0m46.0s/4m30.0s

running (0m47.0s), 23/30 VUs, 859 complete and 0 interrupted iterations
default   [  17% ] 23/30 VUs  0m47.0s/4m30.0s

running (0m48.0s), 24/30 VUs, 877 complete and 0 interrupted iterations
default   [  18% ] 24/30 VUs  0m48.0s/4m30.0s

running (0m49.0s), 24/30 VUs, 883 complete and 0 interrupted iterations
default   [  18% ] 24/30 VUs  0m49.0s/4m30.0s

running (0m50.0s), 25/30 VUs, 883 complete and 0 interrupted iterations
default   [  19% ] 25/30 VUs  0m50.0s/4m30.0s

running (0m51.0s), 25/30 VUs, 921 complete and 0 interrupted iterations
default   [  19% ] 25/30 VUs  0m51.0s/4m30.0s

running (0m52.0s), 26/30 VUs, 957 complete and 0 interrupted iterations
default   [  19% ] 26/30 VUs  0m52.0s/4m30.0s

running (0m53.0s), 26/30 VUs, 962 complete and 0 interrupted iterations
default   [  20% ] 26/30 VUs  0m53.0s/4m30.0s

running (0m54.0s), 27/30 VUs, 989 complete and 0 interrupted iterations
default   [  20% ] 27/30 VUs  0m54.0s/4m30.0s

running (0m55.0s), 27/30 VUs, 1024 complete and 0 interrupted iterations
default   [  20% ] 27/30 VUs  0m55.0s/4m30.0s

running (0m56.0s), 28/30 VUs, 1046 complete and 0 interrupted iterations
default   [  21% ] 28/30 VUs  0m56.0s/4m30.0s

running (0m57.0s), 28/30 VUs, 1060 complete and 0 interrupted iterations
default   [  21% ] 28/30 VUs  0m57.0s/4m30.0s

running (0m58.0s), 29/30 VUs, 1076 complete and 0 interrupted iterations
default   [  21% ] 29/30 VUs  0m58.0s/4m30.0s

running (0m59.0s), 29/30 VUs, 1116 complete and 0 interrupted iterations
default   [  22% ] 29/30 VUs  0m59.0s/4m30.0s

running (1m00.0s), 29/30 VUs, 1158 complete and 0 interrupted iterations
default   [  22% ] 29/30 VUs  1m00.0s/4m30.0s

running (1m01.0s), 30/30 VUs, 1178 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m01.0s/4m30.0s

running (1m02.0s), 30/30 VUs, 1193 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m02.0s/4m30.0s

running (1m03.0s), 30/30 VUs, 1215 complete and 0 interrupted iterations
default   [  23% ] 30/30 VUs  1m03.0s/4m30.0s

running (1m04.0s), 30/30 VUs, 1224 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m04.0s/4m30.0s

running (1m05.0s), 30/30 VUs, 1224 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m05.0s/4m30.0s

running (1m06.0s), 30/30 VUs, 1234 complete and 0 interrupted iterations
default   [  24% ] 30/30 VUs  1m06.0s/4m30.0s

running (1m07.0s), 30/30 VUs, 1235 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  1m07.0s/4m30.0s

running (1m08.0s), 30/30 VUs, 1235 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  1m08.0s/4m30.0s

running (1m09.0s), 30/30 VUs, 1269 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m09.0s/4m30.0s

running (1m10.0s), 30/30 VUs, 1281 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m10.0s/4m30.0s

running (1m11.0s), 30/30 VUs, 1281 complete and 0 interrupted iterations
default   [  26% ] 30/30 VUs  1m11.0s/4m30.0s

running (1m12.0s), 30/30 VUs, 1305 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m12.0s/4m30.0s

running (1m13.0s), 30/30 VUs, 1344 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m13.0s/4m30.0s

running (1m14.0s), 30/30 VUs, 1358 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  1m14.0s/4m30.0s

running (1m15.0s), 30/30 VUs, 1360 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  1m15.0s/4m30.0s

running (1m16.0s), 30/30 VUs, 1387 complete and 0 interrupted iterations
default   [  28% ] 30/30 VUs  1m16.0s/4m30.0s

running (1m17.0s), 30/30 VUs, 1427 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m17.0s/4m30.0s

running (1m18.0s), 30/30 VUs, 1450 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m18.0s/4m30.0s

running (1m19.0s), 30/30 VUs, 1463 complete and 0 interrupted iterations
default   [  29% ] 30/30 VUs  1m19.0s/4m30.0s

running (1m20.0s), 30/30 VUs, 1513 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m20.0s/4m30.0s

running (1m21.0s), 30/30 VUs, 1568 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m21.0s/4m30.0s

running (1m22.0s), 30/30 VUs, 1608 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  1m22.0s/4m30.0s

running (1m23.0s), 30/30 VUs, 1631 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m23.0s/4m30.0s

running (1m24.0s), 30/30 VUs, 1657 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m24.0s/4m30.0s

running (1m25.0s), 30/30 VUs, 1677 complete and 0 interrupted iterations
default   [  31% ] 30/30 VUs  1m25.0s/4m30.0s

running (1m26.0s), 30/30 VUs, 1709 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  1m26.0s/4m30.0s

running (1m27.0s), 30/30 VUs, 1736 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  1m27.0s/4m30.0s

running (1m28.0s), 30/30 VUs, 1772 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m28.0s/4m30.0s

running (1m29.0s), 30/30 VUs, 1801 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m29.0s/4m30.0s

running (1m30.0s), 30/30 VUs, 1802 complete and 0 interrupted iterations
default   [  33% ] 30/30 VUs  1m30.0s/4m30.0s

running (1m31.0s), 30/30 VUs, 1832 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m31.0s/4m30.0s

running (1m32.0s), 30/30 VUs, 1852 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m32.0s/4m30.0s

running (1m33.0s), 30/30 VUs, 1858 complete and 0 interrupted iterations
default   [  34% ] 30/30 VUs  1m33.0s/4m30.0s

running (1m34.0s), 30/30 VUs, 1890 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m34.0s/4m30.0s

running (1m35.0s), 30/30 VUs, 1901 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  1m35.0s/4m30.0s

running (1m36.0s), 30/30 VUs, 1935 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m36.0s/4m30.0s

running (1m37.0s), 30/30 VUs, 1937 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m37.0s/4m30.0s

running (1m38.0s), 30/30 VUs, 1938 complete and 0 interrupted iterations
default   [  36% ] 30/30 VUs  1m38.0s/4m30.0s

running (1m39.0s), 30/30 VUs, 1965 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m39.0s/4m30.0s

running (1m40.0s), 30/30 VUs, 2032 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m40.0s/4m30.0s

running (1m41.0s), 30/30 VUs, 2090 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  1m41.0s/4m30.0s

running (1m42.0s), 30/30 VUs, 2138 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m42.0s/4m30.0s

running (1m43.0s), 30/30 VUs, 2180 complete and 0 interrupted iterations
default   [  38% ] 30/30 VUs  1m43.0s/4m30.0s

running (1m44.0s), 30/30 VUs, 2186 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m44.0s/4m30.0s

running (1m45.0s), 30/30 VUs, 2198 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m45.0s/4m30.0s

running (1m46.0s), 30/30 VUs, 2231 complete and 0 interrupted iterations
default   [  39% ] 30/30 VUs  1m46.0s/4m30.0s

running (1m47.0s), 30/30 VUs, 2252 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m47.0s/4m30.0s

running (1m48.0s), 30/30 VUs, 2283 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m48.0s/4m30.0s

running (1m49.0s), 30/30 VUs, 2306 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  1m49.0s/4m30.0s

running (1m50.0s), 30/30 VUs, 2311 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m50.0s/4m30.0s

running (1m51.0s), 30/30 VUs, 2322 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m51.0s/4m30.0s

running (1m52.0s), 30/30 VUs, 2347 complete and 0 interrupted iterations
default   [  41% ] 30/30 VUs  1m52.0s/4m30.0s

running (1m53.0s), 30/30 VUs, 2353 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m53.0s/4m30.0s

running (1m54.0s), 30/30 VUs, 2386 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  1m54.0s/4m30.0s

running (1m55.0s), 30/30 VUs, 2422 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m55.0s/4m30.0s

running (1m56.0s), 30/30 VUs, 2463 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m56.0s/4m30.0s

running (1m57.0s), 30/30 VUs, 2505 complete and 0 interrupted iterations
default   [  43% ] 30/30 VUs  1m57.0s/4m30.0s

running (1m58.0s), 30/30 VUs, 2552 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m58.0s/4m30.0s

running (1m59.0s), 30/30 VUs, 2552 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  1m59.0s/4m30.0s

running (2m00.0s), 30/30 VUs, 2584 complete and 0 interrupted iterations
default   [  44% ] 30/30 VUs  2m00.0s/4m30.0s

running (2m01.0s), 30/30 VUs, 2620 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  2m01.0s/4m30.0s

running (2m02.0s), 30/30 VUs, 2652 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  2m02.0s/4m30.0s

running (2m03.0s), 30/30 VUs, 2704 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m03.0s/4m30.0s

running (2m04.0s), 30/30 VUs, 2739 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m04.0s/4m30.0s

running (2m05.0s), 30/30 VUs, 2782 complete and 0 interrupted iterations
default   [  46% ] 30/30 VUs  2m05.0s/4m30.0s

running (2m06.0s), 30/30 VUs, 2782 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m06.0s/4m30.0s

running (2m07.0s), 30/30 VUs, 2782 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m07.0s/4m30.0s

running (2m08.0s), 30/30 VUs, 2837 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  2m08.0s/4m30.0s

running (2m09.0s), 30/30 VUs, 2879 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  2m09.0s/4m30.0s

running (2m10.0s), 30/30 VUs, 2880 complete and 0 interrupted iterations
default   [  48% ] 30/30 VUs  2m10.0s/4m30.0s

running (2m11.0s), 30/30 VUs, 2912 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m11.0s/4m30.0s

running (2m12.0s), 30/30 VUs, 2966 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m12.0s/4m30.0s

running (2m13.0s), 30/30 VUs, 3013 complete and 0 interrupted iterations
default   [  49% ] 30/30 VUs  2m13.0s/4m30.0s

running (2m14.0s), 30/30 VUs, 3037 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m14.0s/4m30.0s

running (2m15.0s), 30/30 VUs, 3064 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m15.0s/4m30.0s

running (2m16.0s), 30/30 VUs, 3117 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  2m16.0s/4m30.0s

running (2m17.0s), 30/30 VUs, 3134 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m17.0s/4m30.0s

running (2m18.0s), 30/30 VUs, 3134 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m18.0s/4m30.0s

running (2m19.0s), 30/30 VUs, 3166 complete and 0 interrupted iterations
default   [  51% ] 30/30 VUs  2m19.0s/4m30.0s

running (2m20.0s), 30/30 VUs, 3214 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  2m20.0s/4m30.0s

running (2m21.0s), 30/30 VUs, 3247 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  2m21.0s/4m30.0s

running (2m22.0s), 30/30 VUs, 3258 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m22.0s/4m30.0s

running (2m23.0s), 30/30 VUs, 3258 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m23.0s/4m30.0s

running (2m24.0s), 30/30 VUs, 3288 complete and 0 interrupted iterations
default   [  53% ] 30/30 VUs  2m24.0s/4m30.0s

running (2m25.0s), 30/30 VUs, 3328 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m25.0s/4m30.0s

running (2m26.0s), 30/30 VUs, 3368 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m26.0s/4m30.0s

running (2m27.0s), 30/30 VUs, 3414 complete and 0 interrupted iterations
default   [  54% ] 30/30 VUs  2m27.0s/4m30.0s

running (2m28.0s), 30/30 VUs, 3465 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  2m28.0s/4m30.0s

running (2m29.0s), 30/30 VUs, 3492 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  2m29.0s/4m30.0s

running (2m30.0s), 30/30 VUs, 3504 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m30.0s/4m30.0s

running (2m31.0s), 30/30 VUs, 3533 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m31.0s/4m30.0s

running (2m32.0s), 30/30 VUs, 3536 complete and 0 interrupted iterations
default   [  56% ] 30/30 VUs  2m32.0s/4m30.0s

running (2m33.0s), 30/30 VUs, 3552 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m33.0s/4m30.0s

running (2m34.0s), 30/30 VUs, 3606 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m34.0s/4m30.0s

running (2m35.0s), 30/30 VUs, 3656 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  2m35.0s/4m30.0s

running (2m36.0s), 30/30 VUs, 3657 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  2m36.0s/4m30.0s

running (2m37.0s), 30/30 VUs, 3670 complete and 0 interrupted iterations
default   [  58% ] 30/30 VUs  2m37.0s/4m30.0s

running (2m38.0s), 30/30 VUs, 3727 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m38.0s/4m30.0s

running (2m39.0s), 30/30 VUs, 3734 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m39.0s/4m30.0s

running (2m40.0s), 30/30 VUs, 3738 complete and 0 interrupted iterations
default   [  59% ] 30/30 VUs  2m40.0s/4m30.0s

running (2m41.0s), 30/30 VUs, 3798 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m41.0s/4m30.0s

running (2m42.0s), 30/30 VUs, 3816 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m42.0s/4m30.0s

running (2m43.0s), 30/30 VUs, 3816 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  2m43.0s/4m30.0s

running (2m44.0s), 30/30 VUs, 3868 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m44.0s/4m30.0s

running (2m45.0s), 30/30 VUs, 3906 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m45.0s/4m30.0s

running (2m46.0s), 30/30 VUs, 3906 complete and 0 interrupted iterations
default   [  61% ] 30/30 VUs  2m46.0s/4m30.0s

running (2m47.0s), 30/30 VUs, 3916 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  2m47.0s/4m30.0s

running (2m48.0s), 30/30 VUs, 3950 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  2m48.0s/4m30.0s

running (2m49.0s), 30/30 VUs, 3961 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m49.0s/4m30.0s

running (2m50.0s), 30/30 VUs, 3982 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m50.0s/4m30.0s

running (2m51.0s), 30/30 VUs, 3997 complete and 0 interrupted iterations
default   [  63% ] 30/30 VUs  2m51.0s/4m30.0s

running (2m52.0s), 30/30 VUs, 4011 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m52.0s/4m30.0s

running (2m53.0s), 30/30 VUs, 4030 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m53.0s/4m30.0s

running (2m54.0s), 30/30 VUs, 4066 complete and 0 interrupted iterations
default   [  64% ] 30/30 VUs  2m54.0s/4m30.0s

running (2m55.0s), 30/30 VUs, 4112 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  2m55.0s/4m30.0s

running (2m56.0s), 30/30 VUs, 4139 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  2m56.0s/4m30.0s

running (2m57.0s), 30/30 VUs, 4153 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m57.0s/4m30.0s

running (2m58.0s), 30/30 VUs, 4164 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m58.0s/4m30.0s

running (2m59.0s), 30/30 VUs, 4166 complete and 0 interrupted iterations
default   [  66% ] 30/30 VUs  2m59.0s/4m30.0s

running (3m00.0s), 30/30 VUs, 4186 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m00.0s/4m30.0s

running (3m01.0s), 30/30 VUs, 4187 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m01.0s/4m30.0s

running (3m02.0s), 30/30 VUs, 4187 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  3m02.0s/4m30.0s

running (3m02.9s), 30/30 VUs, 4216 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  3m03.0s/4m30.0s

running (3m03.9s), 30/30 VUs, 4240 complete and 0 interrupted iterations
default   [  68% ] 30/30 VUs  3m04.0s/4m30.0s

running (3m04.9s), 30/30 VUs, 4240 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m05.0s/4m30.0s

running (3m05.9s), 30/30 VUs, 4257 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m06.0s/4m30.0s

running (3m06.9s), 30/30 VUs, 4266 complete and 0 interrupted iterations
default   [  69% ] 30/30 VUs  3m07.0s/4m30.0s

running (3m07.9s), 30/30 VUs, 4266 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m08.0s/4m30.0s

running (3m08.9s), 30/30 VUs, 4288 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m09.0s/4m30.0s

running (3m09.9s), 30/30 VUs, 4316 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  3m10.0s/4m30.0s

running (3m10.9s), 30/30 VUs, 4337 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m11.0s/4m30.0s

running (3m11.9s), 30/30 VUs, 4352 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m12.0s/4m30.0s

running (3m12.9s), 30/30 VUs, 4355 complete and 0 interrupted iterations
default   [  71% ] 30/30 VUs  3m13.0s/4m30.0s

running (3m13.9s), 30/30 VUs, 4368 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  3m14.0s/4m30.0s

running (3m14.9s), 30/30 VUs, 4403 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  3m15.0s/4m30.0s

running (3m15.9s), 30/30 VUs, 4405 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m16.0s/4m30.0s

running (3m16.9s), 30/30 VUs, 4410 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m17.0s/4m30.0s

running (3m17.9s), 30/30 VUs, 4463 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  3m18.0s/4m30.0s

running (3m18.9s), 30/30 VUs, 4498 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m19.0s/4m30.0s

running (3m19.9s), 30/30 VUs, 4498 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m20.0s/4m30.0s

running (3m20.9s), 30/30 VUs, 4510 complete and 0 interrupted iterations
default   [  74% ] 30/30 VUs  3m21.0s/4m30.0s

running (3m21.9s), 30/30 VUs, 4596 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  3m22.0s/4m30.0s

running (3m22.9s), 30/30 VUs, 4640 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  3m23.0s/4m30.0s

running (3m23.9s), 30/30 VUs, 4655 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m24.0s/4m30.0s

running (3m24.9s), 30/30 VUs, 4655 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m25.0s/4m30.0s

running (3m25.9s), 30/30 VUs, 4670 complete and 0 interrupted iterations
default   [  76% ] 30/30 VUs  3m26.0s/4m30.0s

running (3m26.9s), 30/30 VUs, 4698 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m27.0s/4m30.0s

running (3m27.9s), 30/30 VUs, 4701 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m28.0s/4m30.0s

running (3m28.9s), 30/30 VUs, 4715 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  3m29.0s/4m30.0s

running (3m29.9s), 30/30 VUs, 4719 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  3m30.0s/4m30.0s

running (3m30.9s), 30/30 VUs, 4725 complete and 0 interrupted iterations
default   [  78% ] 30/30 VUs  3m31.0s/4m30.0s

running (3m31.9s), 30/30 VUs, 4754 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m32.0s/4m30.0s

running (3m32.9s), 30/30 VUs, 4801 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m33.0s/4m30.0s

running (3m33.9s), 30/30 VUs, 4806 complete and 0 interrupted iterations
default   [  79% ] 30/30 VUs  3m34.0s/4m30.0s

running (3m34.9s), 30/30 VUs, 4816 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m35.0s/4m30.0s

running (3m35.9s), 30/30 VUs, 4870 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m36.0s/4m30.0s

running (3m36.9s), 30/30 VUs, 4931 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  3m37.0s/4m30.0s

running (3m37.9s), 30/30 VUs, 4962 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m38.0s/4m30.0s

running (3m38.9s), 30/30 VUs, 4971 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m39.0s/4m30.0s

running (3m39.9s), 30/30 VUs, 4973 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  3m40.0s/4m30.0s

running (3m40.9s), 30/30 VUs, 5014 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  3m41.0s/4m30.0s

running (3m41.9s), 30/30 VUs, 5014 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  3m42.0s/4m30.0s

running (3m42.9s), 30/30 VUs, 5014 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m43.0s/4m30.0s

running (3m43.9s), 30/30 VUs, 5041 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m44.0s/4m30.0s

running (3m44.9s), 30/30 VUs, 5041 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  3m45.0s/4m30.0s

running (3m45.9s), 30/30 VUs, 5041 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m46.0s/4m30.0s

running (3m46.9s), 30/30 VUs, 5068 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m47.0s/4m30.0s

running (3m47.9s), 30/30 VUs, 5095 complete and 0 interrupted iterations
default   [  84% ] 30/30 VUs  3m48.0s/4m30.0s

running (3m48.9s), 30/30 VUs, 5103 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  3m49.0s/4m30.0s

running (3m49.9s), 30/30 VUs, 5126 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  3m50.0s/4m30.0s

running (3m50.9s), 30/30 VUs, 5134 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m51.0s/4m30.0s

running (3m51.9s), 30/30 VUs, 5156 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m52.0s/4m30.0s

running (3m52.9s), 30/30 VUs, 5174 complete and 0 interrupted iterations
default   [  86% ] 30/30 VUs  3m53.0s/4m30.0s

running (3m53.9s), 30/30 VUs, 5203 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m54.0s/4m30.0s

running (3m54.9s), 30/30 VUs, 5226 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m55.0s/4m30.0s

running (3m55.9s), 30/30 VUs, 5230 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  3m56.0s/4m30.0s

running (3m56.9s), 30/30 VUs, 5238 complete and 0 interrupted iterations
default   [  88% ] 30/30 VUs  3m57.0s/4m30.0s

running (3m57.9s), 30/30 VUs, 5265 complete and 0 interrupted iterations
default   [  88% ] 30/30 VUs  3m58.0s/4m30.0s

running (3m58.9s), 30/30 VUs, 5291 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  3m59.0s/4m30.0s

running (3m59.9s), 30/30 VUs, 5297 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  4m00.0s/4m30.0s

running (4m00.9s), 30/30 VUs, 5324 complete and 0 interrupted iterations
default   [  89% ] 30/30 VUs  4m01.0s/4m30.0s

running (4m01.9s), 29/30 VUs, 5353 complete and 0 interrupted iterations
default   [  90% ] 29/30 VUs  4m02.0s/4m30.0s

running (4m02.9s), 28/30 VUs, 5386 complete and 0 interrupted iterations
default   [  90% ] 28/30 VUs  4m03.0s/4m30.0s

running (4m03.9s), 28/30 VUs, 5387 complete and 0 interrupted iterations
default   [  90% ] 28/30 VUs  4m04.0s/4m30.0s

running (4m04.9s), 28/30 VUs, 5391 complete and 0 interrupted iterations
default   [  91% ] 28/30 VUs  4m05.0s/4m30.0s

running (4m05.9s), 27/30 VUs, 5407 complete and 0 interrupted iterations
default   [  91% ] 27/30 VUs  4m06.0s/4m30.0s

running (4m06.9s), 27/30 VUs, 5410 complete and 0 interrupted iterations
default   [  91% ] 27/30 VUs  4m07.0s/4m30.0s

running (4m07.9s), 27/30 VUs, 5411 complete and 0 interrupted iterations
default   [  92% ] 27/30 VUs  4m08.0s/4m30.0s

running (4m08.9s), 25/30 VUs, 5428 complete and 0 interrupted iterations
default   [  92% ] 25/30 VUs  4m09.0s/4m30.0s

running (4m09.9s), 23/30 VUs, 5444 complete and 0 interrupted iterations
default   [  93% ] 23/30 VUs  4m10.0s/4m30.0s

running (4m10.9s), 23/30 VUs, 5444 complete and 0 interrupted iterations
default   [  93% ] 23/30 VUs  4m11.0s/4m30.0s

running (4m11.9s), 19/30 VUs, 5463 complete and 0 interrupted iterations
default   [  93% ] 19/30 VUs  4m12.0s/4m30.0s

running (4m12.9s), 18/30 VUs, 5496 complete and 0 interrupted iterations
default   [  94% ] 18/30 VUs  4m13.0s/4m30.0s

running (4m13.9s), 17/30 VUs, 5536 complete and 0 interrupted iterations
default   [  94% ] 17/30 VUs  4m14.0s/4m30.0s

running (4m14.9s), 16/30 VUs, 5577 complete and 0 interrupted iterations
default   [  94% ] 16/30 VUs  4m15.0s/4m30.0s

running (4m15.9s), 15/30 VUs, 5616 complete and 0 interrupted iterations
default   [  95% ] 15/30 VUs  4m16.0s/4m30.0s

running (4m16.9s), 14/30 VUs, 5658 complete and 0 interrupted iterations
default   [  95% ] 14/30 VUs  4m17.0s/4m30.0s

running (4m17.9s), 13/30 VUs, 5695 complete and 0 interrupted iterations
default   [  96% ] 13/30 VUs  4m18.0s/4m30.0s

running (4m18.9s), 12/30 VUs, 5731 complete and 0 interrupted iterations
default   [  96% ] 12/30 VUs  4m19.0s/4m30.0s

running (4m19.9s), 11/30 VUs, 5770 complete and 0 interrupted iterations
default   [  96% ] 11/30 VUs  4m20.0s/4m30.0s

running (4m20.9s), 10/30 VUs, 5783 complete and 0 interrupted iterations
default   [  97% ] 10/30 VUs  4m21.0s/4m30.0s

running (4m21.9s), 10/30 VUs, 5792 complete and 0 interrupted iterations
default   [  97% ] 10/30 VUs  4m22.0s/4m30.0s

running (4m22.9s), 08/30 VUs, 5823 complete and 0 interrupted iterations
default   [  97% ] 08/30 VUs  4m23.0s/4m30.0s

running (4m23.9s), 07/30 VUs, 5852 complete and 0 interrupted iterations
default   [  98% ] 07/30 VUs  4m24.0s/4m30.0s

running (4m24.9s), 06/30 VUs, 5876 complete and 0 interrupted iterations
default   [  98% ] 06/30 VUs  4m25.0s/4m30.0s

running (4m25.9s), 05/30 VUs, 5894 complete and 0 interrupted iterations
default   [  99% ] 05/30 VUs  4m26.0s/4m30.0s

running (4m26.9s), 04/30 VUs, 5900 complete and 0 interrupted iterations
default   [  99% ] 04/30 VUs  4m27.0s/4m30.0s

running (4m27.9s), 04/30 VUs, 5901 complete and 0 interrupted iterations
default   [  99% ] 04/30 VUs  4m28.0s/4m30.0s

running (4m28.9s), 03/30 VUs, 5908 complete and 0 interrupted iterations
default   [ 100% ] 03/30 VUs  4m29.0s/4m30.0s

running (4m29.9s), 01/30 VUs, 5913 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  4m30.0s/4m30.0s

     ✗ status 200
      ↳  92% — ✓ 5492 / ✗ 422

     checks.........................: 92.86% ✓ 5492      ✗ 422 
     data_received..................: 1.7 MB 6.2 kB/s
     data_sent......................: 1.1 MB 3.9 kB/s
     http_req_blocked...............: avg=9.2µs    min=1.87µs  med=5.25µs   max=2.03ms   p(90)=8.35µs   p(95)=9.82µs 
     http_req_connecting............: avg=2.35µs   min=0s      med=0s       max=1.69ms   p(90)=0s       p(95)=0s     
   ✓ http_req_duration..............: avg=946.82ms min=1.55ms  med=466.3ms  max=8.14s    p(90)=2.62s    p(95)=2.96s  
       { expected_response:true }...: avg=945.51ms min=19.49ms med=467.36ms max=8.14s    p(90)=2.62s    p(95)=2.96s  
   ✓ http_req_failed................: 7.13%  ✓ 422       ✗ 5492
     http_req_receiving.............: avg=127.23µs min=17.22µs med=100.5µs  max=5.19ms   p(90)=146.77µs p(95)=214µs  
     http_req_sending...............: avg=48.14µs  min=8.52µs  med=44.43µs  max=414.03µs p(90)=83.07µs  p(95)=98.46µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=946.65ms min=1.47ms  med=466.13ms max=8.14s    p(90)=2.62s    p(95)=2.96s  
     http_reqs......................: 5914   21.895559/s
     iteration_duration.............: avg=1.14s    min=69ms    med=679.92ms max=8.32s    p(90)=2.81s    p(95)=3.18s  
     iterations.....................: 5914   21.895559/s
     test_errors....................: 422    1.562382/s
     test_latency_ms................: avg=946.99ms min=2ms     med=466.5ms  max=8.14s    p(90)=2.62s    p(95)=2.96s  
     test_slow_requests.............: 1109   4.10588/s
     vus............................: 1      min=1       max=30
     vus_max........................: 30     min=30      max=30


running (4m30.1s), 00/30 VUs, 5914 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  4m30s